# Load the necessary libraries. Import and load the dataset with a name uber_drives .

In [2]:

import pandas as pd

In [26]:
# Get the Data
dataset = pd.read_excel(r"C:\Users\hp\uberdrives.xlsx")

## Q1. Show the last 10 records of the dataset. (2 point)

In [4]:

dataset.tail(10)

,START_DATE*,END_DATE*,CATEGORY*,START,STOP,MILES,PURPOSE
1145,12/30/2016 10:15,12/30/2016 10:33,Business,Karachi,Karachi,2.8,Errand/Supplies
1146,12/30/2016 11:31,12/30/2016 11:56,Business,Karachi,Karachi,2.9,Errand/Supplies
1147,12/30/2016 15:41,12/30/2016 16:03,Business,Karachi,Karachi,4.6,Errand/Supplies
1148,12/30/2016 16:45,12/30/2016 17:08,Business,Karachi,Karachi,4.6,Meeting
1149,12/30/2016 23:06,12/30/2016 23:10,Business,Karachi,Karachi,0.8,Customer Visit
1150,12/31/2016 1:07,12/31/2016 1:14,Business,Karachi,Karachi,0.7,Meeting
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Karachi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site

## Q2. Show the first 10 records of the dataset. (2 points)

In [5]:
dataset.head(10)

,START_DATE*,END_DATE*,CATEGORY*,START,STOP,MILES,PURPOSE
0,2016-01-01 21:11:00,2016-01-01 21:17:00,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,2016-02-01 01:25:00,2016-02-01 01:37:00,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,2016-02-01 20:25:00,2016-02-01 20:38:00,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,2016-05-01 17:31:00,2016-05-01 17:45:00,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,2016-06-01 14:42:00,2016-06-01 15:49:00,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
5,2016-06-01 17:15:00,2016-06-01 17:19:00,Business,West Palm Beach,West Palm Beach,4.3,Meal/Entertain
6,2016-06-01 17:30:00,2016-06-01 17:35:00,Business,West Palm Beach,Palm Beach,7.1,Meeting
7,2016-07-01 13:27:00,2016-07-01 13:33:00,Business,Cary,Cary,0.8,Meeting
8,2016-10-01 08:05:00,2016-10-01 08:25:00,Business,Cary,Morrisville,8.3,Meeting
9,2016-10-01 12:17:00,2016-10-01 12:44:00,Business,Jamaica,New York,16.5,Customer Visit

## Q3. Show the dimension(number of rows and columns) of the dataset. (2 points)

In [6]:
dimensions = dataset.shape
print('(rows,columns) =',dimensions)

(rows,columns) = (1155, 7)

## Q4. Show the size (Total number of elements) of the dataset. (2 points)

In [7]:
total_number_of_elements = dataset.shape[0] * dataset.shape[1]
print("The total number of elements in dataset =",total_number_of_elements)

The total number of elements in dataset = 8085

# Q5. Display the information about all the variables of the data set. What can you infer from the output?(1 +2 points)

Hint: Information includes - Total number of columns,variable data-types, number of non-null values in a variable, and usage

In [8]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1155 entries, 0 to 1154
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DATE*  1155 non-null   object
 1   END_DATE*    1155 non-null   object
 2   CATEGORY*    1155 non-null   object
 3   START        1155 non-null   object
 4   STOP         1155 non-null   object
 5   MILES        1155 non-null   float64
 6   PURPOSE      653 non-null    object
dtypes: float64(1), object(6)
memory usage: 63.3+ KB

Total number of columns, variables = 7.
There are 6 object data types and 1 float data type. Only miles column is float data type.
PURPOSE column has 653 non-null values, rest of the columns have 1155 non-null values.
The total memory usage is 63.3KB.

## Q6. Check for missing values. (2 points) 

####  Note: Output should contain only one boolean value

In [16]:
dataset.isnull()
#if boolean = true indicates there is a null/missing value.

      START_DATE*  END_DATE*  CATEGORY*  START   STOP  MILES  PURPOSE
0           False      False      False  False  False  False    False
1           False      False      False  False  False  False     True
2           False      False      False  False  False  False    False
3           False      False      False  False  False  False    False
4           False      False      False  False  False  False    False
...           ...        ...        ...    ...    ...    ...      ...
1150        False      False      False  False  False  False    False
1151        False      False      False  False  False  False    False
1152        False      False      False  False  False  False    False
1153        False      False      False  False  False  False    False
1154        False      False      False  False  False  False    False

[1155 rows x 7 columns]

In [28]:
#THIS IS TO CHECK IF THERE ARE ANY MISSING VALUES, if boolean = True indicates there is a null/missing value.
dataset.isnull().values.any()

True

## Q7. How many missing values are present in the entire dataset? (2 points)

In [12]:
# total count of missing values
print('Total number of missing values:',dataset.isnull().sum().sum())

Total number of missing values: 502

## Q8. Get the summary of the original data. (2 points).

#### Hint: Summary includes- Count,Mean, Std, Min, 25%,50%,75% and max

In [12]:
dataset.describe()

             MILES
count  1155.000000
mean     10.566840
std      21.579106
min       0.500000
25%       2.900000
50%       6.000000
75%      10.400000
max     310.300000



## Q9. Drop the missing values and store the data in a new dataframe (name it"df") (2-points)

#### Note: Dataframe "df" will not contain any missing value

In [14]:
df = dataset.dropna()
df

,START_DATE*,END_DATE*,CATEGORY*,START,STOP,MILES,PURPOSE
0,2016-01-01 21:11:00,2016-01-01 21:17:00,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
2,2016-02-01 20:25:00,2016-02-01 20:38:00,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,2016-05-01 17:31:00,2016-05-01 17:45:00,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,2016-06-01 14:42:00,2016-06-01 15:49:00,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
5,2016-06-01 17:15:00,2016-06-01 17:19:00,Business,West Palm Beach,West Palm Beach,4.3,Meal/Entertain
...,...,...,...,...,...,...,...
1150,12/31/2016 1:07,12/31/2016 1:14,Business,Karachi,Karachi,0.7,Meeting
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Karachi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site

## Q10. Check the information of the dataframe(df). (1 points)

#### Hint: Information includes - Total number of columns,variable data-types, number of non-null values in a variable, and usage

In [15]:

df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 653 entries, 0 to 1154
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DATE*  653 non-null    object
 1   END_DATE*    653 non-null    object
 2   CATEGORY*    653 non-null    object
 3   START        653 non-null    object
 4   STOP         653 non-null    object
 5   MILES        653 non-null    float64
 6   PURPOSE      653 non-null    object
dtypes: float64(1), object(6)
memory usage: 40.8+ KB

## Q11. Get the unique start locations. (2 points)
#### Note: This question is based on the dataframe with no 'NA' values

In [18]:
start_location_df = df.START.unique()
start_location_df

array(['Fort Pierce', 'West Palm Beach', 'Cary', 'Jamaica', 'New York',
       'Elmhurst', 'Midtown', 'East Harlem', 'Flatiron District',
       'Midtown East', 'Hudson Square', 'Lower Manhattan',
       "Hell's Kitchen", 'Downtown', 'Gulfton', 'Houston', 'Eagan Park',
       'Morrisville', 'Durham', 'Farmington Woods', 'Lake Wellingborough',
       'Fayetteville Street', 'Raleigh', 'Whitebridge', 'Hazelwood',
       'Fairmont', 'Meredith Townes', 'Apex', 'Chapel Hill', 'Northwoods',
       'Edgehill Farms', 'Eastgate', 'East Elmhurst', 'Long Island City',
       'Katunayaka', 'Colombo', 'Nugegoda', 'Unknown Location',
       'Islamabad', 'R?walpindi', 'Noorpur Shahan', 'Preston',
       'Heritage Pines', 'Tanglewood', 'Waverly Place', 'Wayne Ridge',
       'Westpark Place', 'East Austin', 'The Drag', 'South Congress',
       'Georgian Acres', 'North Austin', 'West University', 'Austin',
       'Katy', 'Sharpstown', 'Sugar Land', 'Galveston', 'Port Bolivar',
       'Washington Avenue', 'Briar Meadow', 'Latta', 'Jacksonville',
       'Lake Reams', 'Orlando', 'Kissimmee', 'Daytona Beach', 'Ridgeland',
       'Florence', 'Meredith', 'Holly Springs', 'Chessington', 'Burtrose',
       'Parkway', 'Mcvan', 'Capitol One', 'University District',
       'Seattle', 'Redmond', 'Bellevue', 'San Francisco', 'Palo Alto',
       'Sunnyvale', 'Newark', 'Menlo Park', 'Old City', 'Savon Height',
       'Kilarney Woods', 'Townes at Everett Crossing', 'Huntington Woods',
       'Weston', 'Seaport', 'Medical Centre', 'Rose Hill', 'Soho',
       'Tribeca', 'Financial District', 'Oakland', 'Emeryville',
       'Berkeley', 'Kenner', 'CBD', 'Lower Garden District', 'Storyville',
       'New Orleans', 'Chalmette', 'Arabi', 'Pontchartrain Shores',
       'Metairie', 'Summerwinds', 'Parkwood', 'Banner Elk', 'Boone',
       'Stonewater', 'Lexington Park at Amberly', 'Winston Salem',
       'Asheville', 'Topton', 'Renaissance', 'Santa Clara', 'Ingleside',
       'West Berkeley', 'Mountain View', 'El Cerrito', 'Krendle Woods',
       'Fuquay-Varina', 'Rawalpindi', 'Lahore', 'Karachi', 'Katunayake',
       'Gampaha'], dtype=object)

## Q12. What is the total number of unique start locations? (1 points)
#### Note: Use the original dataframe without dropping 'NA' values

In [19]:
start_location = dataset.START.unique()
len(start_location)

176

## Q13. What is the total number of unique stop locations. (1 points)
#### Note: Use the original dataframe without dropping 'NA' values.

In [20]:
stop_location = dataset.STOP.unique()
stop_location
len(stop_location)

187

## Q14. Display all Uber trips that has the starting point as San Francisco. (1 points)
#### Note: Use the original dataframe without dropping the 'NA' values.

In [21]:
dataset.loc[dataset['START'] == 'San Francisco']

,START_DATE*,END_DATE*,CATEGORY*,START,STOP,MILES,PURPOSE
362,2016-09-05 14:39:00,2016-09-05 15:06:00,Business,San Francisco,Palo Alto,20.5,Between Offices
440,6/14/2016 16:09,6/14/2016 16:39,Business,San Francisco,Emeryville,11.6,Meeting
836,10/19/2016 14:02,10/19/2016 14:31,Business,San Francisco,Berkeley,10.8,NaN
917,2016-07-11 19:17:00,2016-07-11 19:57:00,Business,San Francisco,Berkeley,13.2,Between Offices
919,2016-08-11 12:16:00,2016-08-11 12:49:00,Business,San Francisco,Berkeley,11.3,Meeting
927,2016-09-11 18:40:00,2016-09-11 19:17:00,Business,San Francisco,Oakland,12.7,Customer Visit
933,2016-10-11 15:17:00,2016-10-11 15:22:00,Business,San Francisco,Oakland,9.9,Temporary Site
966,11/15/2016 20:44,11/15/2016 21:00,Business,San Francisco,Berkeley,11.8,Temporary Site

## Q15. What is the most popular starting point for the Uber drivers? (2 points)
#### Note: Use the original dataframe without dropping the 'NA' values.

#### Hint:Popular means the place that is visited the most

In [23]:
popular_start = dataset['START'].value_counts().idxmax()
print( "%s is the most popular starting point."%(popular_start))

Cary is the most popular starting point.

## Q16. What is the most popular dropping point for the Uber drivers? (2 points)
#### Note: Use the original dataframe without dropping the 'NA' values.

#### Hint: Popular means the place that is visited the most

In [24]:
popular_drop = dataset['STOP'].value_counts().idxmax()
print( "%s is the most popular dropping point."%(popular_drop))

Cary is the most popular dropping point.

## Q17. Display all types of purposes for the trip in an array. (1 points)
#### Note: This question is based on the new dataframe with no 'NA' values.

In [25]:
purpose = df.PURPOSE.unique()
purpose

array(['Meal/Entertain', 'Errand/Supplies', 'Meeting', 'Customer Visit',
       'Temporary Site', 'Between Offices', 'Charity ($)', 'Commute',
       'Moving', 'Airport/Travel'], dtype=object)

***THE END***